Repository: elioschmutz/cbdealer-wp-child
Catalog: languages/*.po
Languages: de_de

source: Mantis Child
de_de: CBDealer Theme

source: Shipping Insurance
de_de: Versicherung

source: Add shipping insurance
de_de: Versicherung bis 5'000 CHF hinzufügen

source: Express shipping
de_de: Express-Lieferung

source: Add express shipping
de_de: Express-Lieferung hinzufügen

source: Registered delivery
de_de: Einschreiben

source: Add registered delivery
de_de: Einschreiben hinzufügen

source: Delivery time
de_de: Lieferzeit

source: days
de_de: Tage

source: I agree, that I am at least 18 years old
de_de: Ich bestätige, dass ich mindestens 18 Jahre alt bin

source: I want to subscribe to the newsletter
de_de: Ja ich möchte mich für den Newsletter eintragen und beim nächsten Einkauf 10% Rabatt sichern (optional)

source: Please validate your age
de_de: Bitte bestätige dein Alter
